---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainAddToOptionSet
source: html/d73d5909-c162-066b-562c-698dd77c5903.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainAddToOptionSet Property

Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictBoundariesVaryMainAddToOptionSet { get; }
```